`terraform apply` output for pilot-hubs:

<details>
<pre>
google_service_account.cluster_sa: Refreshing state... [id=projects/two-eye-two-see/serviceAccounts/pilot-hubs-cluster-sa@two-eye-two-see.iam.gserviceaccount.com]
google_project_iam_custom_role.identify_project_role: Refreshing state... [id=projects/two-eye-two-see/roles/pilot_hubs_user_sa_role]
google_service_account.cd_sa: Refreshing state... [id=projects/two-eye-two-see/serviceAccounts/pilot-hubs-cd-sa@two-eye-two-see.iam.gserviceaccount.com]
google_artifact_registry_repository.registry: Refreshing state... [id=projects/two-eye-two-see/locations/us-central1/repositories/pilot-hubs-registry]
google_project_iam_member.cluster_sa_roles["roles/monitoring.metricWriter"]: Refreshing state... [id=two-eye-two-see/roles/monitoring.metricWriter/serviceAccount:pilot-hubs-cluster-sa@two-eye-two-see.iam.gserviceaccount.com]
google_project_iam_member.cluster_sa_roles["roles/monitoring.viewer"]: Refreshing state... [id=two-eye-two-see/roles/monitoring.viewer/serviceAccount:pilot-hubs-cluster-sa@two-eye-two-see.iam.gserviceaccount.com]
google_project_iam_member.cluster_sa_roles["roles/logging.logWriter"]: Refreshing state... [id=two-eye-two-see/roles/logging.logWriter/serviceaccount:pilot-hubs-cluster-sa@two-eye-two-see.iam.gserviceaccount.com]
google_project_iam_member.cluster_sa_roles["roles/artifactregistry.reader"]: Refreshing state... [id=two-eye-two-see/roles/artifactregistry.reader/serviceAccount:pilot-hubs-cluster-sa@two-eye-two-see.iam.gserviceaccount.com]
google_project_iam_member.cluster_sa_roles["roles/stackdriver.resourceMetadata.writer"]: Refreshing state... [id=two-eye-two-see/roles/stackdriver.resourceMetadata.writer/serviceAccount:pilot-hubs-cluster-sa@two-eye-two-see.iam.gserviceaccount.com]
google_project_iam_member.cd_sa_roles["roles/artifactregistry.writer"]: Refreshing state... [id=two-eye-two-see/roles/artifactregistry.writer/serviceAccount:pilot-hubs-cd-sa@two-eye-two-see.iam.gserviceaccount.com]
google_service_account_key.cd_sa: Refreshing state... [id=projects/two-eye-two-see/serviceAccounts/pilot-hubs-cd-sa@two-eye-two-see.iam.gserviceaccount.com/keys/ee245c75f6c3fa5a36ae59597b356f4c6da80334]
google_project_iam_member.cd_sa_roles["roles/container.admin"]: Refreshing state... [id=two-eye-two-see/roles/container.admin/serviceaccount:pilot-hubs-cd-sa@two-eye-two-see.iam.gserviceaccount.com]
google_project_iam_member.identify_project_binding: Refreshing state... [id=two-eye-two-see/projects/two-eye-two-see/roles/pilot_hubs_user_sa_role/serviceAccount:pilot-hubs-cluster-sa@two-eye-two-see.iam.gserviceaccount.com]
google_container_cluster.cluster: Refreshing state... [id=projects/two-eye-two-see/locations/us-central1-b/clusters/pilot-hubs-cluster]
google_container_node_pool.notebook["paleo"]: Refreshing state... [id=projects/two-eye-two-see/locations/us-central1-b/clusters/pilot-hubs-cluster/nodePools/nb-paleo]
google_container_node_pool.notebook["user"]: Refreshing state... [id=projects/two-eye-two-see/locations/us-central1-b/clusters/pilot-hubs-cluster/nodePools/nb-user]
google_container_node_pool.dask_worker["worker"]: Refreshing state... [id=projects/two-eye-two-see/locations/us-central1-b/clusters/pilot-hubs-cluster/nodePools/dask-worker]
google_container_node_pool.core: Refreshing state... [id=projects/two-eye-two-see/locations/us-central1-b/clusters/pilot-hubs-cluster/nodePools/core-pool]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # google_container_cluster.cluster has changed
  ~ resource "google_container_cluster" "cluster" {
        id                          = "projects/two-eye-two-see/locations/us-central1-b/clusters/pilot-hubs-cluster"
        name                        = "pilot-hubs-cluster"
        # (26 unchanged attributes hidden)











      ~ node_pool {
          ~ initial_node_count          = 20 -> 0
          ~ instance_group_urls         = [
              - "https://www.googleapis.com/compute/v1/projects/two-eye-two-see/zones/us-central1-b/instanceGroupManagers/gke-pilot-hubs-cluster-nb-paleo-a6c38cd7-grp",
              + "https://www.googleapis.com/compute/v1/projects/two-eye-two-see/zones/us-central1-b/instanceGroupManagers/gke-pilot-hubs-cluster-nb-user-dabe793e-grp",
            ]
          ~ managed_instance_group_urls = [
              - "https://www.googleapis.com/compute/beta/projects/two-eye-two-see/zones/us-central1-b/instanceGroups/gke-pilot-hubs-cluster-nb-paleo-a6c38cd7-grp",
              + "https://www.googleapis.com/compute/beta/projects/two-eye-two-see/zones/us-central1-b/instanceGroups/gke-pilot-hubs-cluster-nb-user-dabe793e-grp",
            ]
          ~ name                        = "nb-paleo" -> "nb-user"
            # (4 unchanged attributes hidden)

          ~ autoscaling {
              ~ max_node_count = 100 -> 20
              ~ min_node_count = 20 -> 0
            }


          ~ node_config {
              ~ labels            = {
                  - "2i2c.org/community"           = "paleo" -> null
                    # (2 unchanged elements hidden)
                }
                tags              = []
                # (12 unchanged attributes hidden)


                # (2 unchanged blocks hidden)
            }

            # (2 unchanged blocks hidden)
        }
      + node_pool {
          + initial_node_count          = 10
          + instance_group_urls         = [
              + "https://www.googleapis.com/compute/v1/projects/two-eye-two-see/zones/us-central1-b/instanceGroupManagers/gke-pilot-hubs-cluster-nb-paleo-690ff684-grp",
            ]
          + managed_instance_group_urls = [
              + "https://www.googleapis.com/compute/beta/projects/two-eye-two-see/zones/us-central1-b/instanceGroups/gke-pilot-hubs-cluster-nb-paleo-690ff684-grp",
            ]
          + max_pods_per_node           = 0
          + name                        = "nb-paleo"
          + node_count                  = 1
          + node_locations              = [
              + "us-central1-b",
            ]
          + version                     = "1.20.12-gke.1500"

          + autoscaling {
              + max_node_count = 100
              + min_node_count = 0
            }

          + management {
              + auto_repair  = true
              + auto_upgrade = false
            }

          + node_config {
              + disk_size_gb      = 100
              + disk_type         = "pd-standard"
              + guest_accelerator = []
              + image_type        = "COS_CONTAINERD"
              + labels            = {
                  + "2i2c.org/community"           = "paleo"
                  + "hub.jupyter.org/node-purpose" = "user"
                  + "k8s.dask.org/node-purpose"    = "scheduler"
                }
              + local_ssd_count   = 0
              + machine_type      = "n1-highmem-4"
              + metadata          = {
                  + "disable-legacy-endpoints" = "true"
                }
              + oauth_scopes      = [
                  + "https://www.googleapis.com/auth/cloud-platform",
                ]
              + preemptible       = false
              + service_account   = "pilot-hubs-cluster-sa@two-eye-two-see.iam.gserviceaccount.com"
              + spot              = false
              + tags              = []
              + taint             = [
                  + {
                      + effect = "NO_SCHEDULE"
                      + key    = "hub.jupyter.org_dedicated"
                      + value  = "user"
                    },
                ]

              + shielded_instance_config {
                  + enable_integrity_monitoring = true
                  + enable_secure_boot          = false
                }

              + workload_metadata_config {
                  + mode = "GKE_METADATA"
                }
            }

          + upgrade_settings {
              + max_surge       = 1
              + max_unavailable = 0
            }
        }




        # (16 unchanged blocks hidden)
    }

  # google_container_node_pool.notebook["paleo"] has changed
  ~ resource "google_container_node_pool" "notebook" {
        id                          = "projects/two-eye-two-see/locations/us-central1-b/clusters/pilot-hubs-cluster/nodePools/nb-paleo"
      ~ initial_node_count          = 0 -> 10
        name                        = "nb-paleo"
      ~ node_count                  = 0 -> 1
        # (7 unchanged attributes hidden)

      ~ autoscaling {
          ~ max_node_count = 20 -> 100
            # (1 unchanged attribute hidden)
        }



        # (3 unchanged blocks hidden)
    }

  # google_project_iam_member.cd_sa_roles["roles/container.admin"] has changed
  ~ resource "google_project_iam_member" "cd_sa_roles" {
      ~ etag    = "BwXZxSY7xrc=" -> "BwXZxSuDQAQ="
        id      = "two-eye-two-see/roles/container.admin/serviceaccount:pilot-hubs-cd-sa@two-eye-two-see.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }

  # google_project_iam_member.cluster_sa_roles["roles/logging.logWriter"] has changed
  ~ resource "google_project_iam_member" "cluster_sa_roles" {
      ~ etag    = "BwXZxSY7xrc=" -> "BwXZxSuDQAQ="
        id      = "two-eye-two-see/roles/logging.logWriter/serviceaccount:pilot-hubs-cluster-sa@two-eye-two-see.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_container_node_pool.notebook["paleo"] must be replaced
-/+ resource "google_container_node_pool" "notebook" {
      ~ id                          = "projects/two-eye-two-see/locations/us-central1-b/clusters/pilot-hubs-cluster/nodePools/nb-paleo" -> (known after apply)
      ~ initial_node_count          = 10 -> 0 # forces replacement
      ~ instance_group_urls         = [
          - "https://www.googleapis.com/compute/v1/projects/two-eye-two-see/zones/us-central1-b/instanceGroupManagers/gke-pilot-hubs-cluster-nb-paleo-690ff684-grp",
        ] -> (known after apply)
      ~ managed_instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/two-eye-two-see/zones/us-central1-b/instanceGroups/gke-pilot-hubs-cluster-nb-paleo-690ff684-grp",
        ] -> (known after apply)
      + max_pods_per_node           = (known after apply)
        name                        = "nb-paleo"
      + name_prefix                 = (known after apply)
      ~ node_count                  = 1 -> (known after apply)
      ~ node_locations              = [
          - "us-central1-b",
        ] -> (known after apply)
      + operation                   = (known after apply)
      ~ version                     = "1.20.12-gke.1500" -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ autoscaling {
          ~ max_node_count = 100 -> 20
            # (1 unchanged attribute hidden)
        }


      ~ node_config {
          ~ disk_size_gb      = 100 -> (known after apply)
          ~ guest_accelerator = [] -> (known after apply)
          ~ image_type        = "COS_CONTAINERD" -> (known after apply)
          ~ local_ssd_count   = 0 -> (known after apply)
          ~ metadata          = {
              - "disable-legacy-endpoints" = "true"
            } -> (known after apply)
            tags              = []
            # (7 unchanged attributes hidden)

          ~ shielded_instance_config {
              ~ enable_integrity_monitoring = true -> (known after apply)
              ~ enable_secure_boot          = false -> (known after apply)
            }

            # (1 unchanged block hidden)
        }

      ~ upgrade_settings {
          ~ max_surge       = 1 -> (known after apply)
          ~ max_unavailable = 0 -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # google_container_node_pool.notebook["user"] must be replaced
-/+ resource "google_container_node_pool" "notebook" {
      ~ id                          = "projects/two-eye-two-see/locations/us-central1-b/clusters/pilot-hubs-cluster/nodePools/nb-user" -> (known after apply)
      ~ instance_group_urls         = [
          - "https://www.googleapis.com/compute/v1/projects/two-eye-two-see/zones/us-central1-b/instanceGroupManagers/gke-pilot-hubs-cluster-nb-user-dabe793e-grp",
        ] -> (known after apply)
      ~ managed_instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/two-eye-two-see/zones/us-central1-b/instanceGroups/gke-pilot-hubs-cluster-nb-user-dabe793e-grp",
        ] -> (known after apply)
      + max_pods_per_node           = (known after apply)
        name                        = "nb-user"
      + name_prefix                 = (known after apply)
      ~ node_count                  = 0 -> (known after apply)
      ~ node_locations              = [
          - "us-central1-b",
        ] -> (known after apply)
      + operation                   = (known after apply)
      ~ version                     = "1.20.12-gke.1500" -> (known after apply)
        # (4 unchanged attributes hidden)



      ~ node_config {
          ~ disk_size_gb      = 100 -> (known after apply)
          ~ disk_type         = "pd-standard" -> "pd-balanced" # forces replacement
          ~ guest_accelerator = [] -> (known after apply)
          ~ image_type        = "COS_CONTAINERD" -> (known after apply)
          ~ local_ssd_count   = 0 -> (known after apply)
          ~ metadata          = {
              - "disable-legacy-endpoints" = "true"
            } -> (known after apply)
            tags              = []
            # (6 unchanged attributes hidden)

          ~ shielded_instance_config {
              ~ enable_integrity_monitoring = true -> (known after apply)
              ~ enable_secure_boot          = false -> (known after apply)
            }

            # (1 unchanged block hidden)
        }

      ~ upgrade_settings {
          ~ max_surge       = 1 -> (known after apply)
          ~ max_unavailable = 0 -> (known after apply)
        }
        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Warning: Argument is deprecated

  with google_filestore_instance.homedirs,
  on storage.tf line 4, in resource "google_filestore_instance" "homedirs":
   4:   zone = var.zone

Deprecated in favor of location.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
</pre>
</details>